Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/Seavantage  Service Deck.tmx
Source language: ko
Languages: en

source: 송형진
en: Song Hyun Jin

source: 2019 하반기
en: 2nd half of 2019

source: 실제 도착시간 예측
en: Estimate actual arrival time

source: 고객 의사 결정에 필요한 정보 제공 서비스
en: of major ports of entry and departure

source: 관심 선박을 내 선단에 등록하여
en: Register the vessel that are part of My fleet

source: POD까지 경유지, TS 정보 제공
en: Maintenance to POD, TS information provided

source: • 시드 투자 유치 (블루포인트파트너스)
en: • Attracting seed investment (Blue Point Partners)

source: 변화를 위한 시작 ”
en: should be where change begins”

source: 씨벤티지는 해양 산업 및 물류 산업에 새로운 패러다임을 제시합니다.
en: SeaVantage presents a new paradigm for the marine and logistics industries.

source: 기상 외력 분석
en: Meteorological analysis of external forces

source: 다양한 개발 환경 지원
en: Support for various development environments

source: [참고] 서비스 제공 방식과 내용은 협의될 수 있습니다.
en: [Note] Service provision method and content may be negotiated.
